const venom = require('venom-bot');

venom
  .create({
    session: 'session-name' //name of session
  })
  .then((client) => start(client))
  .catch((error) => {
    console.log(error);
  });

function start(client) {

  let w1 = false;
  // Function to send the welcome message with options
  const sendOptionsMessage = (chatId) => {
    const optionsMessage = `
      أهلا بك في تجــوَّل!
      سعداء بإستقبال إستفساركم، يرجى إختيار إحدى الخيارات التالية بكتابة الرقم : 
      
      1. وجهاتنا
      2. خدماتنا
      3. إجراء الحجوزات
      4. متابعة و تعديل الحجوزات
      5. التحدث عبر خدمة الدردشة الآلية
    `;
    client.sendText(chatId, optionsMessage);
  };

  client.onMessage((message) => {
    if (message.body !== ""&&w1 ==false) {
      w1 = true;
      // Send welcome message with options if user says 'Hi'
      sendOptionsMessage(message.from);
    } else if (parseInt(message.body) >= 1 && parseInt(message.body) <= 5) {
      // Handle user selection based on the option chosen
      switch (parseInt(message.body)) {
        case 1:
          client.sendText(message.from, `
**إيطاليا**
•	كابري 
•	بوسيتانو 
•	أمالفي
•	سردينيا 
•	بورتوفينو 
•	بحيرة كومو

**فرنسا** 
•	كان
•	موناكو ( مونت كارلو )
•	سان تروبيه 

**سويسرا** 
•	إنترلاكن 
•	سان موريتز 
•	زيرمات 
•	بيرن 

**إسبانيا**
•	ماربيا
•	ملقا 
•	جزر الكناري
•	مايوركا 
•	إبيزا 

**اليونان**
•	ميكونوس
•	سانتوريني 

**تركيا**
•	بودروم
•	كابادوكيا 

**مصر**
•	القاهرة
•	الساحل الشمالي

**إضغط ( 0 ) للعودة للقائمة السابقة**`);
          break;
        case 2:
          client.sendText(message.from, `
*إعداد برنامج الرحلة والجدول الزمني لتنفيذه.*

*إعداد دليل بالإرشادات العامة لكل بلدة يتضمن:* 
•	حالة الطقس المتوقع خلال الرحلة.
•	مواعيد فتح وإغلاق المزارات السياحية والمتاجر.
•	أماكن بيع الأطعمة الحلال.
•	مواقع التصوير (Instagram Spots).
•	أنماط المقابس الكهربائية المستخدمة.


* حجز وتأجير وسائل النقل الداخلية:*
•	طيران خاص.           
•	قطارات.
•	عبارات بحرية.
•	حافلات عامة.
•	يخوت. 
•	سيارات خاصة (سائق او بدون).
•	دراجات (نارية - هوائية عادية أو كهربائية - فيسبا - بيتش باجي - سكوتر كهربائي - سكوتر بورد -  سيج واي). 
•	طيران داخلي.  


*حجز الأنشطة الترفيهية:* 
•	العاب جوية ( قفز حر بالمظلات - باراشوت - طيران شراعي - طيران باراموتور - تزلج هوائي - الإنزلاق على الحبال - قفزة بانجي ).
•	العاب الجليد ( تزحلق - تزلج - تزلج صدري - مزلجة - زحاف جليد ).
•	رحلات برية ( تسلق الجبال - الهبوط من قمم الجبال - تخييم - تزلج على الرمال - ركوب الخيل - ركوب الإبل - سفاري سيارات دفع رباعي - سفاري بيتش باجي ).
•	مغامرات ( رولر كوستر - كوستر جبلي - القطار الجبلي المائل - القطار البخاري - الزحليقة الصيفية - كارتينج - چيت بوت ).
•	مراكز ترفيهية ( العاب وملاهي - أكواريوم - ملاهي مائية - حدائق حيوان ).
•	رياضات مائية ( غطس - غوص - تجديف قوارب - تجديف ألواح - تجديف كاياك -  تزلج على الماء - تزلج على الأمواج - ركوب الأمواج بالألواح الشراعية - ركوب الأمواج بالطائرة الورقية - صيد ).
•	العاب مائية ( چيت سكي - سي بوب - فلاي بورد - فليت بورد - چيت سيرڤ - دراجة مائية ).


*ترتيب الجولات التالية:* 
•	رحلات بحرية ( يخوت - قوارب شراعية - قوارب سريعة - زوارق خشبية كلاسيكية - زودياك - قوارب ذاتية القيادة - غواصة بحرية ). 
•	جولات جوية ( هليكوبتر - منطاد - تلفريك ). 
•	جولات فردية وجماعية داخل المدن بالسيارات والدراجات ( العادية - الكلاسيكية ). 

*حجز الفعاليات الترفيهية والثقافية التالية:* 
•	المتاحف والمعارض.
•	عروض فنية (موسيقية - إستعراضية - مسرحية - عروض الخيل - عروض الثيران).
•	تذاكر مباريات VIP. 

*حجز وترتيب الخدمات التالية:*
•	شواطيء.
•	مطاعم.
•	سهر وحفلات. 
•	كازينو.
•	صالونات تجميل.
•	نوادي صحية.
•	جلسات تصوير مع أمهر المصورين المحترفين.

**إضغط ( 0 ) للعودة للقائمة السابقة**`);
          break;
        case 3:
          client.sendText(message.from, `لإجراء الحجوزات أنقر الرابط التالي 
          https://tajwwal.com/booking
          
          *إضغط ( 0 ) للعودة للقائمة السابقة*`);
          break;
        case 4:
          client.sendText(message.from, `
          برجاء تدوين الرقم المرجعي للحجز 

          *إضغط ( 0 ) للعودة للقائمة السابقة*`);
          break;
        case 5:
          client.sendText(message.from, `
          نشكركم لمراسلتنا من خلال خدمة الواتساب، يرجي تحديد إستفساركم 
          
          *إضغط ( 0 ) للعودة للقائمة السابقة*`);
          break;
        default:
          break;
      }
    } else if (message.body === '0') {
      // Resend options message if user sends '0'
      sendOptionsMessage(message.from);
    }else{
      client.sendText(message.from, `عزيزي العميل، نعتذر لحضراتكم ولكننا لم نتمكن من تحديد إستفساركم بشكل واضح، برجاء إختيار رقم من القائمة السابقة. `);
    }
  });
}
